---
kind: enumMember
id: F:Autodesk.Revit.DB.ViewTemplateApplicationOption.UncontrolledParameters
enum: Autodesk.Revit.DB.ViewTemplateApplicationOption
source: html/e844d7b8-0e29-cd97-d6b4-36b57ba050fd.htm
---
# Autodesk.Revit.DB.ViewTemplateApplicationOption.UncontrolledParameters

Apply only parameters controlled by template and not controlled by currently assigned view template